laba12/app/controllers/business_logic_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def require_login
    unless User.find_by_id (session[:current_user_id])