laba12/app/controllers/users_controller.rb

INSERT INTO "users" ("login", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["login", "ruslan"], ["password", "al6634ag"], ["created_at", "2018-12-19 19:17:29.099557"], ["updated_at", "2018-12-19 19:17:29.099557"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save